In [4]:
# Pandas
import pandas as pd

In [114]:
# data = pd.DataFrame(columns=['Name', 'Age', 'Email'], data=[['Ranjan', 33, 'ranjan@gmail.com'], ['Deepak', 36, 'deepak@gmail.com']])

data = pd.DataFrame({
    'Name' : ['Ranjan', 'Deepak', 'Saikat', 'Jigar'],
    'Age' : [33, 36, 35, 40],
    'Email' : ['ranjan@gmail.com', 'deepak@gmail.com', 'saikat@gmail.com', 'jigar@gmail.com'],
    'Mobile' : ['8866556622', '886645455', '8866544472', '88764654526']
})

In [115]:
data

     Name  Age             Email       Mobile
0  Ranjan   33  ranjan@gmail.com   8866556622
1  Deepak   36  deepak@gmail.com    886645455
2  Saikat   35  saikat@gmail.com   8866544472
3   Jigar   40   jigar@gmail.com  88764654526

In [116]:
# Get first row values
data.iloc[0].values

array(['Ranjan', 33, 'ranjan@gmail.com', '8866556622'], dtype=object)

In [117]:
# Second and third row
data.iloc[1:3, :]

     Name  Age             Email      Mobile
1  Deepak   36  deepak@gmail.com   886645455
2  Saikat   35  saikat@gmail.com  8866544472

In [153]:
# First two column
data.iloc[:, :2]

     Name  Age
0  Ranjan   33
1  Deepak   36
2  Saikat   35
3   Jigar   40

In [158]:
# Second column
data.iloc[:, 1]

0    33
1    36
2    35
3    40
Name: Age, dtype: int64

In [162]:
# Last column
data.iloc[:, -1]

0     8866556622
1      886645455
2     8866544472
3    88764654526
Name: Mobile, dtype: object

In [169]:
# Except last two column
data.iloc[:, 1:-1]

   Age             Email
0   33  ranjan@gmail.com
1   36  deepak@gmail.com
2   35  saikat@gmail.com
3   40   jigar@gmail.com

In [128]:
# Get second row name
data.iloc[1, 0]

'Deepak'

In [129]:
# Get all emails and convert to list
list(data.iloc[:, 2])

['ranjan@gmail.com', 'deepak@gmail.com', 'saikat@gmail.com', 'jigar@gmail.com']

In [130]:
# Second row first two column
list(data.iloc[1, :2])

['Deepak', 36]

In [136]:
# Get by column name
list(data['Age'])

[33, 36, 35, 40]

In [139]:
# Get by multiple column name
data[['Name', 'Age']]

     Name  Age
0  Ranjan   33
1  Deepak   36
2  Saikat   35
3   Jigar   40

In [145]:
# Get employee <= 35 age
data[data['Age'] <= 35]

     Name  Age             Email      Mobile
0  Ranjan   33  ranjan@gmail.com  8866556622
2  Saikat   35  saikat@gmail.com  8866544472